using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Philosophy
{
    class Texts
    {
        public static string[][] Questions = new string[][]
        {
            
            //1 вопрос
            new string[]
            {
                "Що загрожує сучасному людству?",
                "A. Близькість екологічної катастрофи.",
                "B. Демографічний вибух. ",
                "C. Термоядерна пожежа.",
                "D. Релігіозне вчення.",
                "E. Тільки А,B,C ."
            },
            //2 вопрос
            new string[]
            {
                "Що таке свобода?",
                "A. Свобода - це здатність самовизначення. ",
                "B. Свобода - це здатність самореалізації.",
                "C. Свобода - це здатність самообмеження на основі внутрішньої самодисципліни. ",
                "D. Свобода - це бути в залежності тільки від самого себе.",
                "E. Все перераховане. "
            },
            //3 вопрос
            new string []
            {
                " Від чого в першу чергу залежить доля суспільного прогресу?",
                "A. Здоров’я нації. ",
                "B. Розсудливості. " ,
                "C. Контролю людини над природою. ",
                "D. Самовдосконалення на основі любові до інших людей. ",
                "E. Ефективного вирішення глобальних проблем. "
            },
            //4 вопрос
            new string []
            {
                "Термін “Метафізика” застосовується для позначення:",
                "A. Протилежного діалектиці вчення. ",
                "B. Однієї з основних праць Арістотеля. ",
                "C. Методології мислення, пізнання. ",
                "D. Уявлення про рух як механічне переміщення. ",
                "E. Все перераховане."
            },
            //5 вопрос
            new string[]
            {
                "Дійсність це-:",
                "A. Реалізована можливість. ",
                "B. Буття, визначене в часі і просторі.",
                "C. Об'єктивна реальність, конкретизована сукупністю різних ознак. ",
                "D. Те, що є насправді.",
                "E. Все перераховане."
            },
            //6 вопрос
            new string[]
            {
                "Субстанція- це",
                "A. Внутрішня сутність, що визначає можливі форми матеріального та духовного буття.",
                "B. Середньовічний термін для визначення творця світобудови. ",
                "C. Логічний термін для позначення об'єкта, що має властивості, але сам властивістю не є. ",
                "E. Напрямлення в теорії познання, вважаюче інтуіцію джерелом знань",
                "D. Все перераховане"
            },
            //7 вопрос
            new string[]
            {
                "Ви отримали щасливе питання. Oбирайте правильний пункт і рушайте далі",
                "A. Неправильна відповідь ",
                "В. Правильна відповідь",
                "С. Неправильна відповідь",
                "D. Неправильна відповідь",
                "E.Неправильна відповідь "
            },
            //8 вопрос
            new string[]
            {
                " Які функції в накуовому пізнанні виконує теорія? Відзначте невірну",
                "A. Завдання теорії - класифікувати об’єкти або явища світу. ",
                "B. Теорія повинна описувати явища природи и суспільства.",
                "C. Мета будь-якої теорії - пояснення явищ.",
                "D. Головне завдання теорії - пророкування нових явищ, майбутніх подій. ",
                "E. Мета теорії - просто і економно викласти емпіричні дані. "
            },
            //9 вопрос
            new string[]
            {
                "Хто розробив методику постановки на контроль свідомості несвідомих процесів?",
                "A. Кант. ",
                "B. Шопенгауер. ",
                "C. Гартман",
                "D. Бергсон. ",
                "E. Фрейд."
            } ,
            //10 вопрос
            new string[]
            {
                " Філосовське визначення властивості відображення: ",
                "A. Вигляд в дзеркалі (воді, склі, металі і т.д.). ",
                "B. Опір тискові, напору, нападу ('відбити напад противника'). ",
                "C. Здатність зберігати і відтворювати властивості систем, що впливають на об’єкт. ",
                "D. Зворотно пропорційна рівність в математиці.",
                "E. Оптичне явище ('кут відображення рівний куті падіння'). "
            },
            //11 вопрос
            new string[]
            {
                "Знайти зайве:",
                "A. Буття - космос, досконалий, вічний, матеріальний. ",
                "B. Буття - світ ідей, що породжує предметно-чуттєвий світ. ",
                "C. Буття - це поле Бога, що сам є істинне Буття. ",
                "D. Буття - це природа в цілому.",
                "E. Буття - це час існування чого-небудь від піщинки до Всесвіту. "
            },
            //12 вопрос
            new string[]
            {
                "Розвиток це зміна матеріальних реальних об'єктів, що характеризуеться:",
                "A. Об’єктивністю. ",
                "B. Незворотністю. ",
                "C. Причинністю. ",
                "D. Наступністю. ",
                "E. Нагромадженням позитивного. "
            },
            //13 вопрос
            new string[]
            {
                "Субстанція-це:",
                "A. Внутрішня сутність, що визначає можливі форми матеріального та духовного буття. ",
                "B. Середньовічний термін для визначення творця світобудови. ",
                "C. Логічний термін для позначення об'єкта, що має властивості, але сам властивістю не є. ",
                "D. Матерія",
                "Е. Все перераховане."
            },
            //14 вопрос
            new string[]
            {
                "Ідеальне –це(Вказати те, що не входить до цього терміну):",
                "A. Еталонне, абсолютно довершене. ",
                "B. Мислиме. ",
                "C. Шедевр художньої творчості. ",
                "D. Похідне від матеріального.",
                "E. Протилежність реального. "
            },
            //15 вопрос
            new string[]
            {
                "„Книга буття українского народа ” Написав: ",
                "A. Т. Шевченко.",
                "B. П. Куліш.",
                "C. М. Костомаров.",
                "D. М. Грушевський",
                "Е. Г. Сковорода"
            },
            //16 вопрос
            new string[]
            {
                "Г.Сковорода виділяв три світи ",
                "A. Мікрокосм, макрокосм та світ Біблії. ",
                "B. Світ матерії, свідомості та природи. ",
                "C. Всесвіт, земля, підземний світ. ",
                "D. Світ води, вогню та повітря.",
                "Е. Все перераховане."
            },
            //17 вопрос
            new string[]
            {
                "Характерні риси української філософії:",
                "A. Екзистенційність. ",
                "B. Моральна спрямованість.",
                "C. Кордоцентризм.",
                "D. Антеїзм. ",
                "E. Все перераховане."
            },
            //18 вопрос
            new string[]
            {
                "Основоположником психоаналізу є:",
                "A. З. Фрейд. ",
                "B. Д. Юнг. ",
                "C. Е. Фромм. ",
                "D. А. Камю.",
                "Е. І. Павлов"
            },
            //19 вопрос
            new string[]
            {
                "Раціоналісти доводили, що основну роль в процесі пізнання відіграє:",
                "A. Органи чуття.",
                "B. Розум. ",
                "C. Внутрішня інтуїція. ",
                "D. Безпосередній контакт суб’єкта з об’єктом.",
                "Е. Органи."
            },
            //20 вопрос
            new string[]
            {
                "Чиїм улюбленим висловом є 'Пізнай самого себе'",
                "A. Емпедокл. ",
                "B. Зенон.",
                "C. Сократ. ",
                "D. Арістотель.",
                "Е. Діоген."
            },
            //21 вопрос
            new string[]
            {
                "'Золоте правило ' моралі Конфуція",
                "A. Не бажай іншому того, чого не бажаєш собі. ",
                "B. Мета виправдовує засоби. ",
                "C. Поведінка людини залежить від ситуації. ",
                "D. Не можна визначити загальних правил поведінки.",
                "Е. Інша відповідь."
            },
        };
        //Ответы
        public static string[] Answer =new string[]
        {
            //1 вопрос// 
            "E",
            //2 вопрос//
            "E",
            //3 вопрос
            "E",
            //4 вопрос
            "E",
            //5вопрос//
            "E",
            //6 вопрос//
            "E",
            //7 вопрос//
            "B",
            //8 вопрос //
            "C",
            //9 вопрос//
            "E",
            //10 вопрос //
            "B",
            //11 вопрос //
            "A",
            //12 вопрос //
            "C",
            //13 вопрос //
            "C",
            //14 вопрос //
            "A",
            //15 вопрос //
            "E",
            //16 вопрос //
            "A",
            //17 вопрос //
            "B",
            //18 вопрос //
            "C",
            //19 вопрос //
            "В",
            //20 вопрос //
            "С",
            //21 вопрос //
            "A",

        };
    }
}
